In [1]:
import pandas as pd
import numpy as np
import warnings
warnings.filterwarnings('ignore')
import pylab as plt 
import seaborn as sns

In [2]:
#Carga de datos y  comprobación del shape
pd.set_option('display.max_columns', None)
old_HDD_ori = pd.read_csv("../data/old_HDD.csv", encoding = "latin1")
old_HDD_ori.shape

(1000, 5)

In [3]:
#Carga de datos y  comprobación del shape
pd.set_option('display.max_columns', None)
actor_ori = pd.read_csv("../data/actor.csv", encoding = "latin1")
actor_ori.shape

(200, 4)

In [4]:
#Carga de datos y  comprobación del shape
pd.set_option('display.max_columns', None)
film_ori = pd.read_csv("../data/film.csv", encoding = "latin1")
film_ori.shape

(1000, 13)

In [5]:
old_HDD = old_HDD_ori.copy()
actor = actor_ori.copy()
film = film_ori.copy()

In [6]:
actor.drop_duplicates(["last_name","first_name"], inplace = True)

# Añado columna con nombre completo a old_HDD

In [7]:
old_HDD['full_name'] = old_HDD['first_name'] + " "+old_HDD['last_name']

In [8]:
old_HDD.head()

,first_name,last_name,title,release_year,category_id,full_name
0,PENELOPE,GUINESS,ACADEMY DINOSAUR,2006,6,PENELOPE GUINESS
1,PENELOPE,GUINESS,ANACONDA CONFESSIONS,2006,2,PENELOPE GUINESS
2,PENELOPE,GUINESS,ANGELS LIFE,2006,13,PENELOPE GUINESS
3,PENELOPE,GUINESS,BULWORTH COMMANDMENTS,2006,10,PENELOPE GUINESS
4,PENELOPE,GUINESS,CHEAPER CLYDE,2006,14,PENELOPE GUINESS

# Añado columna con nombre completo a actor

In [9]:
actor['full_name'] = actor['first_name'] + " "+actor['last_name']

In [10]:
actor.head()

   actor_id first_name     last_name          last_update            full_name
0         1   PENELOPE       GUINESS  2006-02-15 04:34:33     PENELOPE GUINESS
1         2       NICK      WAHLBERG  2006-02-15 04:34:33        NICK WAHLBERG
2         3         ED         CHASE  2006-02-15 04:34:33             ED CHASE
3         4   JENNIFER         DAVIS  2006-02-15 04:34:33       JENNIFER DAVIS
4         5     JOHNNY  LOLLOBRIGIDA  2006-02-15 04:34:33  JOHNNY LOLLOBRIGIDA

# Añado columna con el actor_id a los registros de old_HDD

In [11]:
old_HDD["actor_id"] = ""

In [12]:
i = 0
for ele in actor["full_name"]:
    j = 0
    for fil in old_HDD["full_name"]:
        if ele == fil:            
            old_HDD.iloc[j,6] = actor.iloc[i, 0]           
        j += 1
    i += 1

In [13]:
old_HDD.head()

,first_name,last_name,title,release_year,category_id,full_name,actor_id
0,PENELOPE,GUINESS,ACADEMY DINOSAUR,2006,6,PENELOPE GUINESS,1
1,PENELOPE,GUINESS,ANACONDA CONFESSIONS,2006,2,PENELOPE GUINESS,1
2,PENELOPE,GUINESS,ANGELS LIFE,2006,13,PENELOPE GUINESS,1
3,PENELOPE,GUINESS,BULWORTH COMMANDMENTS,2006,10,PENELOPE GUINESS,1
4,PENELOPE,GUINESS,CHEAPER CLYDE,2006,14,PENELOPE GUINESS,1

# Añado columna con el film_id a los registros de old_HDD

In [14]:
old_HDD["film_id"] = ""
old_HDD.head()

,first_name,last_name,title,release_year,category_id,full_name,actor_id,film_id
0,PENELOPE,GUINESS,ACADEMY DINOSAUR,2006,6,PENELOPE GUINESS,1,
1,PENELOPE,GUINESS,ANACONDA CONFESSIONS,2006,2,PENELOPE GUINESS,1,
2,PENELOPE,GUINESS,ANGELS LIFE,2006,13,PENELOPE GUINESS,1,
3,PENELOPE,GUINESS,BULWORTH COMMANDMENTS,2006,10,PENELOPE GUINESS,1,
4,PENELOPE,GUINESS,CHEAPER CLYDE,2006,14,PENELOPE GUINESS,1,

In [15]:
i = 0
for ele in film["title"]:
    j = 0
    for fil in old_HDD["title"]:
        if ele == fil:            
            old_HDD.iloc[j,7] = film.iloc[i, 0]           
        j += 1
    i += 1

In [16]:
old_HDD.head()

,first_name,last_name,title,release_year,category_id,full_name,actor_id,film_id
0,PENELOPE,GUINESS,ACADEMY DINOSAUR,2006,6,PENELOPE GUINESS,1,1
1,PENELOPE,GUINESS,ANACONDA CONFESSIONS,2006,2,PENELOPE GUINESS,1,23
2,PENELOPE,GUINESS,ANGELS LIFE,2006,13,PENELOPE GUINESS,1,25
3,PENELOPE,GUINESS,BULWORTH COMMANDMENTS,2006,10,PENELOPE GUINESS,1,106
4,PENELOPE,GUINESS,CHEAPER CLYDE,2006,14,PENELOPE GUINESS,1,140

In [17]:
lista_films = list(film.title.unique())

In [18]:
print(old_HDD.shape)
indices = []
i=0
for ele in old_HDD["title"]:
    if ele not in lista_films:
        indices.append(i)
    i += 1

indices

(1000, 8)

[]

# Borro todas las columnas de old_HDD salvo title_id, actor_id y category_id

old_HDD.drop(indices, inplace=True)

In [19]:
old_HDD.drop(columns = ["last_name","first_name","title","release_year","full_name"], inplace = True)

In [20]:
#Carga de datos y  comprobación del shape
pd.set_option('display.max_columns', None)
inventory_ori = pd.read_csv("../data/inventory.csv", encoding = "latin1")
inventory_ori.shape

(1000, 4)

# Creo una columna para incluir la categoria de la pelicula el film y añado una categoria (17) para los casos donde no sea conocida

In [21]:
film["category_id"] = None

In [22]:
i = 0
for ele in old_HDD["film_id"]:
    j = 0
    for fil in film["film_id"]:
        if ele == fil:            
            film.iloc[j,13] = old_HDD.iloc[i,0]   
        j += 1          
    i += 1

In [23]:
film.category_id.value_counts()

2     50
15    46
11    45
13    45
6     44
1     43
9     40
7     40
4     38
14    36
8     34
16    32
3     32
5     32
12    31
10    26
Name: category_id, dtype: int64

In [24]:
film.category_id.fillna(17, inplace = True)

# Elimino la columna "original_language_id" de film por ser todos sus valores nulos y "last_update" de film, actor y old_HDD por no considerarse útil en este caso

In [25]:
film.drop(columns = ["original_language_id"], inplace = True)

In [26]:
film.head()

,film_id,title,description,release_year,language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,last_update,category_id
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes",2006-02-15 05:03:42,6
1,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,2006,1,3,4.99,48,12.99,G,"Trailers,Deleted Scenes",2006-02-15 05:03:42,11
2,3,ADAPTATION HOLES,A Astounding Reflection of a Lumberjack And a ...,2006,1,7,2.99,50,18.99,NC-17,"Trailers,Deleted Scenes",2006-02-15 05:03:42,6
3,4,AFFAIR PREJUDICE,A Fanciful Documentary of a Frisbee And a Lumb...,2006,1,5,2.99,117,26.99,G,"Commentaries,Behind the Scenes",2006-02-15 05:03:42,17
4,5,AFRICAN EGG,A Fast-Paced Documentary of a Pastry Chef And ...,2006,1,6,2.99,130,22.99,G,Deleted Scenes,2006-02-15 05:03:42,17

In [27]:
film.drop(columns = ["last_update"], inplace = True)

In [28]:
old_HDD.drop(columns = ["category_id"], inplace = True)

In [29]:
actor.drop(columns = ["last_update"], inplace = True)

# Utilizo ahora el DataFrame old_HDD como una tabla relacional entre film y actor

In [30]:
film_cast = old_HDD.copy()

In [31]:
#film_cast.insert(0, 'cast_id', [i+1 for i in range(len(film_cast))])
#film_cast.head()

In [32]:
film_cast.head()

  actor_id film_id
0        1       1
1        1      23
2        1      25
3        1     106
4        1     140

In [33]:
actor.head()

   actor_id first_name     last_name            full_name
0         1   PENELOPE       GUINESS     PENELOPE GUINESS
1         2       NICK      WAHLBERG        NICK WAHLBERG
2         3         ED         CHASE             ED CHASE
3         4   JENNIFER         DAVIS       JENNIFER DAVIS
4         5     JOHNNY  LOLLOBRIGIDA  JOHNNY LOLLOBRIGIDA

In [34]:
film.category_id.astype(dtype ="int64")
#film.info()

0       6
1      11
2       6
3      17
4      17
       ..
995     6
996    12
997    11
998    17
999    17
Name: category_id, Length: 1000, dtype: int64

In [35]:
film_cast.actor_id.astype(dtype ="int64")
film_cast.film_id.astype(dtype ="int64")

0        1
1       23
2       25
3      106
4      140
      ...
995    168
996    203
997    222
998    290
999    293
Name: film_id, Length: 1000, dtype: int64

In [36]:
film_cast.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   actor_id  1000 non-null   object
 1   film_id   1000 non-null   object
dtypes: object(2)
memory usage: 15.8+ KB

In [37]:
actor.reset_index(drop=True, inplace=True)
actor.to_csv("../data/actor_clean.csv", index=False)

In [38]:
film_cast.reset_index(drop=True, inplace=True)
film_cast.to_csv("../data/film_cast.csv", index=False)

In [39]:
film.reset_index(drop=True, inplace=True)
film.to_csv("../data/film_clean.csv", index=False)

In [40]:
film.head()

,film_id,title,description,release_year,language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,category_id
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes",6
1,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,2006,1,3,4.99,48,12.99,G,"Trailers,Deleted Scenes",11
2,3,ADAPTATION HOLES,A Astounding Reflection of a Lumberjack And a ...,2006,1,7,2.99,50,18.99,NC-17,"Trailers,Deleted Scenes",6
3,4,AFFAIR PREJUDICE,A Fanciful Documentary of a Frisbee And a Lumb...,2006,1,5,2.99,117,26.99,G,"Commentaries,Behind the Scenes",17
4,5,AFRICAN EGG,A Fast-Paced Documentary of a Pastry Chef And ...,2006,1,6,2.99,130,22.99,G,Deleted Scenes,17